Abhidip_demo/app/controllers/posts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
INSERT INTO `posts` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('2013-02-02 18:11:29', 'I\'m Abhidip Ray...', 'My Post', '2013-02-02 18:11:29', 15)
---
def create
user=User.find(params[:user_id])
post=user.posts.create(params[:post])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1
---
def index
  @user =User.find(params[:user_id])
  @posts=@user.posts.find(:all)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 15 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 15 AND `posts`.`id` = 15 LIMIT 1
---
def show

  @user=User.find(params[:user_id])
  @post=@user.posts.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 14 AND `posts`.`id` = 1 LIMIT 1
---
def edit
@user=User.find(params[:user_id])
@post=@user.posts.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 14 AND `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `description` = 'fghfgfi', `updated_at` = '2013-02-03 15:48:59' WHERE `posts`.`id` = 1
---
def update
@user=User.find(params[:user_id])
@post=@user.posts.find(params[:id])
@post.update_attributes(params[:post])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 14 AND `posts`.`id` = 5 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 5
---
def destroy
@user=User.find(params[:user_id])
@post=@user.posts.find(params[:id])
@post.destroy