Abhidip_demo/app/controllers/users_controller.rb

INSERT INTO `users` (`age`, `contact_no`, `created_at`, `dept`, `email`, `roll`, `updated_at`, `user_name`) VALUES (22, 24178797, '2013-02-05 14:22:32', 'CSE', 'banerjee.sayan@gmail.com', 5, '2013-02-05 14:22:32', 'Sayan Banerjee')
---
def create
@user=User.create(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 8
---
def destroy
user=User.find(params[:id])
user.destroy()

SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
UPDATE `users` SET `dept` = 'B', `contact_no` = 24221898, `updated_at` = '2013-02-01 19:18:41' WHERE `users`.`id` = 16
---
def update
user=User.find(params[:user])
user.update_attributes